--[[
Ignored.lua
@Author  : DengSir (tdaddon@163.com)
@Link    : https://dengsir.github.io
]]

local ns = select(2, ...)

ns.IGNORED_NPCS = {
    [  4311] = true,    -- 霍加尔·雷斧 卷土重来
    [ 87391] = true,    -- 命运扭曲者赛瑞斯
    [ 88570] = true,    -- 命运扭曲者提拉尔
    [ 98489] = true,    -- 海难俘虏
    [107934] = true,    -- Recruiter Lee
    [111243] = true,    -- 大法师兰达洛克 <命运大师>
    [119388] = true,    -- 酋长哈顿
    [127037] = true,    -- nabiru
    [142063] = true,    -- 特兹兰 <命运大师>
}

-- 40310,      -- 海难俘虏

-- 40519,      -- 卷土重来 联盟
-- 43926,      -- 卷土重来 部落

-- 36054,      -- 封印命运：金币
-- 36055,      -- 封印命运：埃匹希斯水晶
-- 36056,      -- 封印命运：要塞资源
-- 36057,      -- 封印命运：荣誉
-- 37452,      -- 封印命运：成堆的埃匹希斯水晶
-- 37453,      -- 封印命运：成山的埃匹希斯水晶
-- 37454,      -- 封印命运：大把的金币
-- 37455,      -- 封印命运：巨额的金币
-- 37456,      -- 封印命运：满仓的要塞资源
-- 37457,      -- 封印命运：海量的要塞资源
-- 37458,      -- 封印命运：额外的荣誉
-- 37459,      -- 封印命运：不朽的荣誉

-- 43892,      -- 封印命运：职业大厅资源
-- 43893,      -- 封印命运：成堆的职业大厅资源
-- 43894,      -- 封印命运：海量的职业大厅资源
-- 43895,      -- 封印命运：金币
-- 43896,      -- 封印命运：大把的金币
-- 43897,      -- 封印命运：巨额的金币
-- 47851,      -- 封印命运：荣誉印记
-- 47864,      -- ?封印命运：额外的荣誉印记
-- 47865,      -- ?封印命运：成堆的荣誉印记
